Revit 2027 API
FormatOptions.SetUnitTypeId Method
 Sets the unit used to quantify values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions SetUnitTypeId(
	ForgeTypeId unitTypeId
)
Public Function SetUnitTypeId (
	unitTypeId As ForgeTypeId
) As FormatOptions
public:
FormatOptions^ SetUnitTypeId(
	ForgeTypeId^ unitTypeId
)
member SetUnitTypeId :
        unitTypeId : ForgeTypeId -> FormatOptions
Parameters
unitTypeId ForgeTypeId
 The unit identifier.
Return Value
FormatOptions
Exceptions
Exception | Condition
ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace